ghsecuritylab/stm32_linux/Projects/udemy/Packages/.cache/Keil.Kinetis_K20_DFP.1.5.1.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_K20_DFP</name>
  <description>NXP Kinetis K20 Series Device Support and Examples</description>

  <releases>
    <release version="1.5.1" date="2017-03-21">
      Added sub-family reference manuals for K27F and K28F.  
    </release>
    <release version="1.5.0" date="2017-02-16">
      Reworked K20_DFP.
       - changed vendor to NXP.
       - updated documentation.
       - updated Device startup.
       - changed device vendor to NXP in projects.
      Added FRDM-K28F example.
      Added MK27FN2M0xxx15, MK28FN2M0xxx15 device support.
      Updated device header files: added ARM Clang 6 directives for handling anonymous unions
      Added FAC Flash Algorithm for K22FN devices.
    </release>
    <release version="1.4.0" date="2016-03-01">
      Updated Kinetis Flash Algorithm MK_P128_50MHZ.FLM.
       - correctig BlankCheck() function
      Updated MK24F12 device support files and documentation.
    </release>
    <release version="1.3.0" date="2015-06-03">
      Added MK22FA12 and MK26FN2M0xxx18 device support.
      Updated MK21F12, MK22F12, MK26F18 device support and documentation.
    </release>
    <release version="1.2.0" date="2014-07-30">
      Added MK21DX128Axxx5, MK21DX256Axxx5, MK21DN512Axxx5 devices
      Added MK21FX512Axxx12, MK21FN1M0Axxx12 devices
      Added TWR-K24F120M examples
    </release>
    <release version="1.1.0" date="2014-06-24">
      Added MK24FN256xxx12 device
      Updated K22F CMSIS files.
    </release>
   <release version="1.0.2">
      USB Device Driver: Endpoint read fixed
    </release>
    <release version="1.0.1">
      Added GPIO, DMA and USBD drivers for MK20D5 devices.
      New Device: MK24FN1M0xxx12
    </release>
    <release version="1.0.0">
      First Release version of K20 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>K20</keyword>
  </keywords>

  <devices>
    <family Dfamily="K20 Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
      <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>

      <description>
The Kinetis K2x MCU family is pin-peripheral and software-compatible with many of the Kinetis K series MCU families, offering full and high-speed USB 2.0 On-The-Go, in addition to other features like device charge detect capability and USB crystal-less functionality.
Devices start from 32 KB of flash in 5 x 5 mm 32-pin QFN packages extending up to 2 MB in a 144-pin MAPBGA package.
These devices offer various levels of integration, with a rich suite of analog, communication, timing and control peripherals.
Next-generation Kinetis K2x MCUs are further optimized for performance with industry-leading power consumption and offer more streamlined integration for further BOM cost reductions.
      </description>

      <!-- ******************************  MK20DN128xxx5  ****************************** -->
      <device Dname="MK20DN128xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK20D5.h" define="MK20DN128xxx5"/>
        <debug svd="SVD/MK20D5.svd"/>
        <memory id="IROM1"                        start="0x00000000" size="0x00020000" startup="1" default="1"/>
        <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
        <memory id="IRAM2"                        start="0x1FFFE000" size="0x00002000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P128_50MHZ.FLM" start="0x00000000" size="0x00020000"             default="1"/>

        <book name="Documents/K20P64M50SF0RM.pdf" title="MK20DN128xxx5 Reference Manual"/>
        <book name="Documents/K20P64M50SF0.pdf"   title="MK20DN128xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DN32xxx5  ****************************** -->
      <device Dname="MK20DN32xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK20D5.h" define="MK20DN32xxx5"/>
        <debug svd="SVD/MK20D5.svd"/>
        <memory id="IROM1"                       start="0x00000000" size="0x00008000" startup="1" default="1"/>
        <memory id="IRAM1"                       start="0x20000000" size="0x00001000" init   ="0" default="1"/>
        <memory id="IRAM2"                       start="0x1FFFF000" size="0x00001000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P32_50MHZ.FLM" start="0x00000000" size="0x00008000"             default="1"/>

        <book name="Documents/K20P64M50SF0RM.pdf"          title="MK20DN32xxx5 Reference Manual"/>
        <book name="Documents/K20P64M50SF0.pdf"            title="MK20DN32xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DN64xxx5  ****************************** -->
      <device Dname="MK20DN64xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK20D5.h" define="MK20DN64xxx5"/>
        <debug svd="SVD/MK20D5.svd"/>
        <memory id="IROM1"                       start="0x00000000" size="0x00010000" startup="1" default="1"/>
        <memory id="IRAM1"                       start="0x20000000" size="0x00002000" init   ="0" default="1"/>
        <memory id="IRAM2"                       start="0x1FFFE000" size="0x00002000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P64_50MHZ.FLM" start="0x00000000" size="0x00010000"             default="1"/>

