ghsecuritylab/stm32_linux/Projects/udemy/Packages/.cache/Keil.Kinetis_K20_DFP.1.5.1.pdsc
      <!-- ******************************  MK22DX128xxx5  ****************************** -->
      <device Dname="MK22DX128xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK22D5.h" define="MK22DX128xxx5"/>
        <debug svd="SVD/MK22D5.svd"/>
        <memory id="IROM1"                        start="0x00000000" size="0x00020000" startup="1" default="1"/>
        <memory id="IROM2"                        start="0x10000000" size="0x00010000" startup="0" default="0"/>
        <memory id="IRAM1"                        start="0x20000000" size="0x00004000" init   ="0" default="1"/>
        <memory id="IRAM2"                        start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P128_50MHZ.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        <algorithm name="Flash/MK_D64_50MHZ.FLM"  start="0x10000000" size="0x00010000"             default="1"/>

        <book name="Documents/K22P121M50SF4RM.pdf" title="MK22DX128xxx5 Reference Manual"/>
        <book name="Documents/K22P121M50SF4.pdf"   title="MK22DX128xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK22DX256xxx5  ****************************** -->
      <device Dname="MK22DX256xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK22D5.h" define="MK22DX256xxx5"/>
        <debug svd="SVD/MK22D5.svd"/>
        <memory id="IROM1"                        start="0x00000000" size="0x00040000" startup="1" default="1"/>
        <memory id="IROM2"                        start="0x10000000" size="0x00010000" startup="0" default="0"/>
        <memory id="IRAM1"                        start="0x20000000" size="0x00004000" init   ="0" default="1"/>
        <memory id="IRAM2"                        start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P256_50MHZ.FLM" start="0x00000000" size="0x00040000"             default="1"/>
        <algorithm name="Flash/MK_D64_50MHZ.FLM"  start="0x10000000" size="0x00010000"             default="1"/>

        <book name="Documents/K22P121M50SF4RM.pdf" title="MK22DX256xxx5 Reference Manual"/>
        <book name="Documents/K22P121M50SF4.pdf"   title="MK22DX256xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK22FN128xxx10  ****************************** -->
      <device Dname="MK22FN128xxx10">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device/Include/MK22F12810.h" define="MK22FN128xxx10"/>
        <debug svd="SVD/MK22F12810.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFFE000" size="0x00002000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P128.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        <algorithm name="Flash/MK2x_FAC.FLM" start="0xFFFF0000" size="0x00000024"             default="0"/>

        <book name="Documents/K22P121M100SF9RM.pdf" title="MK22FN128xxx10 Reference Manual"/>
        <book name="Documents/K22P121M100SF9.pdf"   title="MK22FN128xxx10 Data Sheet"/>
      </device>

      <!-- ******************************  MK22FN1M0xxx10  ****************************** -->
      <device Dname="MK22FN1M0xxx10">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device/Include/MK22F10.h" define="MK22FN1M0xxx10"/>
        <debug svd="SVD/MK22F10.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P1M0.FLM" start="0x00000000" size="0x00100000"             default="1"/>

      </device>

      <!-- ******************************  MK22FX512xxx10  ****************************** -->
      <device Dname="MK22FX512xxx10">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device/Include/MK22F10.h" define="MK22FX512xxx10"/>
        <debug svd="SVD/MK22F10.svd"/>
        <memory id="IROM1"                            start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IROM2"                            start="0x10000000" size="0x00020000" startup="0" default="0"/>
        <memory id="IRAM1"                            start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                            start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512X.FLM"          start="0x00000000" size="0x00080000"             default="1"/>
        <algorithm name="Flash/MKD128_4KB_SECTOR.FLM" start="0x10000000" size="0x00020000"             default="1"/>

        </device>

      <!-- ******************************  MK22FN256xxx12  ****************************** -->
      <device Dname="MK22FN256xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK22F25612.h" define="MK22FN256xxx12"/>
        <debug svd="SVD/MK22F25612.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P256.FLM" start="0x00000000" size="0x00040000"             default="1"/>
        <algorithm name="Flash/MK2x_FAC.FLM" start="0xFFFF0000" size="0x00000024"             default="0"/>

