ghsecuritylab/stm32_linux/Projects/udemy/Packages/.cache/Keil.Kinetis_K20_DFP.1.5.1.pdsc
      <!-- ******************************  MK21DN512Axxx5  ***************************** -->
      <device Dname="MK21DN512Axxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK21DA5.h" define="MK21DN512Axxx5"/>
        <debug svd="SVD/MK21DA5.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

        <book name="Documents/K21P121M50SF4V2RM.pdf" title="MK21DN512Axxx5 Reference Manual"/>
        <book name="Documents/K21P121M50SF4V2.pdf"   title="MK21DN512Axxx5 Data Sheet"/>
      </device>

<!-- MK21FA12 Devices -->
      <!-- ******************************  MK21FX512Axxx12  **************************** -->
      <device Dname="MK21FX512Axxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK21FA12.h" define="MK21FX512Axxx12"/>
        <debug svd="SVD/MK21FA12.svd"/>
        <memory id="IROM1"                            start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IROM2"                            start="0x10000000" size="0x00020000" startup="0" default="0"/>
        <memory id="IRAM1"                            start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                            start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512X.FLM"          start="0x00000000" size="0x00080000"             default="1"/>
        <algorithm name="Flash/MKD128_4KB_SECTOR.FLM" start="0x10000000" size="0x00020000"             default="1"/>

        <book name="Documents/K21P144M120SF5V2RM.pdf" title="MK21FX512Axxx12 Reference Manual"/>
        <book name="Documents/K21P144M120SF5V2.pdf"   title="MK21FX512Axxx12 Data Sheet"/>
      </device>

      <!-- ******************************  MK21FN1M0Axxx12  **************************** -->
      <device Dname="MK21FN1M0Axxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK21FA12.h" define="MK21FN1M0Axxx12"/>
        <debug svd="SVD/MK21FA12.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P1M0.FLM" start="0x00000000" size="0x00100000"             default="1"/>

        <book name="Documents/K21P144M120SF5V2RM.pdf" title="MK21FN1M0Axxx12 Reference Manual"/>
        <book name="Documents/K21P144M120SF5V2.pdf"   title="MK21FN1M0Axxx12 Data Sheet"/>
      </device>

<!-- MK22FA12 Devices -->
      <!-- ******************************  MK22FX512Axxx12  ****************************** -->
      <device Dname="MK22FX512Axxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK22FA12.h" define="MK22FX512Axxx12"/>
        <debug svd="SVD/MK22FA12.svd"/>
        <memory id="IROM1"                            start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IROM2"                            start="0x10000000" size="0x00020000" startup="0" default="0"/>
        <memory id="IRAM1"                            start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                            start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512X.FLM"          start="0x00000000" size="0x00080000"             default="1"/>
        <algorithm name="Flash/MKD128_4KB_SECTOR.FLM" start="0x10000000" size="0x00020000"             default="1"/>

        <book name="Documents/K22P144M120SF5V2RM.pdf" title="MK22FX512Axxx12 Reference Manual"/>
        <book name="Documents/K22P144M120SF5V2.pdf"   title="MK22FX512Axxx12 Data Sheet"/>
      </device>

      <!-- ******************************  MK22FN1M0Axxx12  ****************************** -->
      <device Dname="MK22FN1M0Axxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK22FA12.h" define="MK22FN1M0Axxx12"/>
        <debug svd="SVD/MK22FA12.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P1M0.FLM" start="0x00000000" size="0x00100000"             default="1"/>

        <book name="Documents/K22P144M120SF5V2RM.pdf" title="MK22FN1M0Axxx12 Reference Manual"/>
        <book name="Documents/K22P144M120SF5V2.pdf"   title="MK22FN1M0Axxx12 Data Sheet"/>
      </device>

<!-- MK26F18 Devices -->
      <!-- ******************************  MK26FN2M0xxx18  ****************************** -->
      <device Dname="MK26FN2M0xxx18">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="180000000"/>
        <compile header="Device/Include/MK26F18.h" define="MK26FN2M0xxx18"/>
        <debug svd="SVD/MK26F18.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00200000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00030000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P2M0.FLM" start="0x00000000" size="0x00200000"             default="1"/>

        <book name="Documents/K26P169M180SF5RM.pdf" title="MK26FN2M0xxx18 Reference Manual"/>
        <book name="Documents/K26P169M180SF5.pdf"   title="MK26FN2M0xxx18 Data Sheet"/>
      </device>

<!-- MK27F15 Devices -->
      <!-- ******************************  MK27FN2M0xxx15  ****************************** -->
      <device Dname="MK27FN2M0xxx15">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="150000000"/>
        <compile header="Device/Include/MK27F15.h" define="MK27FN2M0xxx15"/>
        <debug svd="SVD/MK27F15.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00200000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFC0000" size="0x00040000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P2M0.FLM" start="0x00000000" size="0x00200000"             default="1"/>

        <book name="Documents/K27F_RM_Rev.1.pdf" title="K27F Sub-Family Reference Manual"/>
        <!--book name="Documents/K27.pdf"   title="K27 Data Sheet"/-->
      </device>

