ghsecuritylab/stm32_linux/Projects/udemy/Packages/.cache/Keil.Kinetis_K20_DFP.1.5.1.pdsc
    <condition id="MK20D10 CMSIS">
      <description>NXP Kinetis MK20D10 device and CMSIS-CORE</description>
      <require condition="MK20D10"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK20F12 CMSIS">
      <description>NXP Kinetis MK20F12 device and CMSIS-CORE</description>
      <require condition="MK20F12"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK21D5 CMSIS">
      <description>NXP Kinetis MK21D5 device and CMSIS-CORE</description>
      <require condition="MK21D5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK21DA5 CMSIS">
      <description>NXP Kinetis MK21DA5 device and CMSIS-CORE</description>
      <require condition="MK21DA5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK21F10 CMSIS">
      <description>NXP Kinetis MK21F10 device and CMSIS-CORE</description>
      <require condition="MK21F10"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK21F12 CMSIS">
      <description>NXP Kinetis K21F12 device and CMSIS-CORE</description>
      <require condition="MK21F12"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK21FA12 CMSIS">
      <description>NXP Kinetis MK21FA12 device and CMSIS-CORE</description>
      <require condition="MK21FA12"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK22D5 CMSIS">
      <description>NXP Kinetis MK22D5 device and CMSIS-CORE</description>
      <require condition="MK22D5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK22F10 CMSIS">
      <description>NXP Kinetis MK22F10 device and CMSIS-CORE</description>
      <require condition="MK22F10"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK22F12 CMSIS">
      <description>NXP Kinetis MK22F12 device and CMSIS-CORE</description>
      <require condition="MK22F12"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK22FA12 CMSIS">
      <description>NXP Kinetis MK22FA12 device and CMSIS-CORE</description>
      <require condition="MK22FA12"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK22F12810 CMSIS">
      <description>NXP Kinetis MK22F12810 device and CMSIS-CORE</description>
      <require condition="MK22F12810"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK22F25612 CMSIS">
      <description>NXP Kinetis MK22F25612 device and CMSIS-CORE</description>
      <require condition="MK22F25612"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK22F51212 CMSIS">
      <description>NXP Kinetis MK22F51212 device and CMSIS-CORE</description>
      <require condition="MK22F51212"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK24F12 CMSIS">
      <description>NXP Kinetis MK24F12 device and CMSIS-CORE</description>
      <require condition="MK24F12"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK24F25612 CMSIS">
      <description>NXP Kinetis MK24F25612 device and CMSIS-CORE</description>
      <require condition="MK24F25612"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK26F18 CMSIS">
      <description>NXP Kinetis MK26F18 device and CMSIS-CORE</description>
      <require condition="MK26F18"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK27F15 CMSIS">
      <description>NXP Kinetis MK27F15 device and CMSIS-CORE</description>
      <require condition="MK27F15"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK28F15 CMSIS">
      <description>NXP Kinetis MK28F15 device and CMSIS-CORE</description>
      <require condition="MK28F15"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- device + Driver Conditions -->
    <condition id="MK20D5 GPIO DMA">
      <description>NXP Kinetis K20D5 Series with GPIO and DMA Driver</description>
      <require condition="MK20D5"/>
      <require Cclass ="Device" Cgroup="GPIO" />
      <require Cclass ="Device" Cgroup="DMA" />
    </condition>

    <condition id="MK20D5 CMSIS RTOS">
      <description>NXP Kinetis K20D5 Series with CMSIS and RTOS</description>
      <require condition="MK20D5"/>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Cclass ="CMSIS" Cgroup="RTOS"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup MK20D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK20D5 CMSIS">
      <description>System Startup for NXP Kinetis MK20D5 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK20D5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK20D5.c"       attr="config" version="1.0.0"/>

        <file category="header"  name="RTE_Driver/Config/RTE_Device.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK20D10 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK20D10 CMSIS">
      <description>System Startup for NXP Kinetis MK20D10 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK20D10.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK20D10.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK20D7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK20D7 CMSIS">
      <description>System Startup for NXP Kinetis MK20D7 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK20D7.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK20D7.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK20F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK20F12 CMSIS">
      <description>System Startup for NXP Kinetis MK20F12 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK20F12.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK20F12.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK21D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK21D5 CMSIS">
      <description>System Startup for NXP Kinetis MK21D5 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK21D5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK21D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

