ghsecuritylab/stm32_linux/Projects/udemy/Packages/.cache/Keil.Kinetis_K20_DFP.1.5.1.pdsc
    <!-- Startup MK21F10 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK21F10 CMSIS">
      <description>System Startup for NXP Kinetis MK21F10 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK21F10.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK21F10.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK22D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK22D5 CMSIS">
      <description>System Startup for NXP Kinetis MK22D5 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK22D5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK22D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK22F10 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK22F10 CMSIS">
      <description>System Startup for NXP Kinetis MK22F10 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK22F10.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK22F10.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK22F12810 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK22F12810 CMSIS">
      <description>System Startup for NXP Kinetis MK22F12810 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK22F12810.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK22F12810.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MK22F12810.h"       attr="config" version="1.0.0"/>

        <!-- Flash Access Control Bytes templat -->
        <file category="source" name="Device/Source/ARM/MK2x_FAC.s"             attr="template"               condition="Compiler ARMCC" select="Flash Execute-Only Access Control Template"/>
     </files>
    </component>

    <!-- Startup MK22F25612 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK22F25612 CMSIS">
      <description>System Startup for NXP Kinetis MK22F25612 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK22F25612.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK22F25612.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MK22F25612.h"       attr="config" version="1.0.0"/>

        <!-- Flash Access Control Bytes templat -->
        <file category="source" name="Device/Source/ARM/MK2x_FAC.s"             attr="template"               condition="Compiler ARMCC" select="Flash Execute-Only Access Control Template"/>
     </files>
    </component>

    <!-- Startup MK22F51212 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK22F51212 CMSIS">
      <description>System Startup for NXP Kinetis MK22F51212 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK22F51212.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK22F51212.c"       attr="config" version="1.0.0"/>

        <!-- Flash Access Control Bytes templat -->
        <file category="source" name="Device/Source/ARM/MK2x_FAC.s"             attr="template"               condition="Compiler ARMCC" select="Flash Execute-Only Access Control Template"/>
     </files>
    </component>

    <!-- Startup MK24F25612 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK24F25612 CMSIS">
      <description>System Startup for NXP Kinetis MK24F25612 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK24F25612.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK24F25612.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MK24F25612.h"       attr="config" version="1.0.0"/>
     </files>
    </component>

    <!-- Startup MK21F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.9.0" condition="MK21F12 CMSIS">
      <description>System Startup for NXP Kinetis MK21F12 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK21F12.s"  attr="config" version="1.9.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK21F12.c"       attr="config" version="1.9.0"/>
        <file category="header"  name="Device/Source/system_MK21F12.h"       attr="config" version="1.9.0"/>
      </files>
    </component>

    <!-- Startup MK21FA12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK21FA12 CMSIS">
      <description>System Startup for NXP Kinetis MK21FA12 120MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK21FA12.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK21FA12.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MK21FA12.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK22F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.9.0" condition="MK22F12 CMSIS">
      <description>System Startup for NXP Kinetis MK22F12 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK22F12.s"  attr="config" version="1.9.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK22F12.c"       attr="config" version="1.9.0"/>
        <file category="header"  name="Device/Source/system_MK22F12.h"       attr="config" version="1.9.0"/>
      </files>
    </component>

    <!-- Startup MK22FA12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.9.0" condition="MK22FA12 CMSIS">
      <description>System Startup for NXP Kinetis MK22FA12 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK22FA12.s"  attr="config" version="1.9.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK22FA12.c"       attr="config" version="1.9.0"/>
        <file category="header"  name="Device/Source/system_MK22FA12.h"       attr="config" version="1.9.0"/>
      </files>
    </component>

