ghsecuritylab/stm32_linux/Projects/udemy/Packages/.cache/Keil.Kinetis_K20_DFP.1.5.1.pdsc
    <!-- Startup MK21DA5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK21DA5 CMSIS">
      <description>System Startup for NXP Kinetis K21DA 50MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK21DA5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK21DA5.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MK21DA5.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK26F18 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="MK26F18 CMSIS">
      <description>System Startup for NXP MK26F18 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK26F18.s" attr="config" version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK26F18.c"      attr="config" version="2.0.0"/>
        <file category="header"  name="Device/Source/system_MK26F18.h"      attr="config" version="2.0.0"/>
      </files>
    </component>

    <!-- Startup MK24F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.3.0" condition="MK24F12 CMSIS">
      <description>System Startup for NXP MK24F12 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK24F12.s" attr="config" version="2.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK24F12.c"      attr="config" version="2.3.0"/>
      </files>
    </component>

    <!-- Startup MK27F15 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK27F15 CMSIS">
      <description>System Startup for NXP MK27F15 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK27F15.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK27F15.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MK27F15.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK28F15 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK28F15 CMSIS">
      <description>System Startup for NXP MK28F15 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK28F15.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK28F15.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MK28F15.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- CMSIS Driver MK20D5 -->
    <component Cclass="Device" Cgroup="GPIO" Cversion="1.0.0" condition="MK20D5">
      <description>GPIO driver used by RTE Drivers for Kinetis K20 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPIO_K20.h"/>
        <file category="source" name="RTE_Driver/GPIO_K20.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="DMA" Cversion="1.0.0" condition="MK20D5">
      <description>DMA driver used by RTE Drivers for Kinetis K20 Series</description>
      <files>
        <file category="header" name="RTE_Driver/DMA_K20.h"/>
        <file category="source" name="RTE_Driver/DMA_K20.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="UART" Cversion="1.0.0" condition="MK20D5 GPIO DMA">
      <description>UART Driver for Kinetis K20 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_UART0               /* Driver UART0 */
        #define RTE_Drivers_UART1               /* Driver UART1 */
        #define RTE_Drivers_UART2               /* Driver UART2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/UART_K20.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="USB device" Cversion="1.1.0" condition="MK20D5 CMSIS RTOS">
      <description>USB device Driver for Kinetis K20 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD_K20.c"/>
      </files>
    </component>

    <!-- TWR-K20D50M Development Board -->
    <component Cclass="Board Support" Cgroup="TWR-K20D50M" Csub="LED" Cversion="0.0.1" condition="K20 50MHz">
      <description>LED driver for NXP TWR-K20D50M Development Board</description>
      <files>
        <file category="header" name="Boards/NXP/TWR-K20D50M/Common/LED.h"/>
        <file category="source" name="Boards/NXP/TWR-K20D50M/Common/LED.c"/>
      </files>
    </component>

    <!-- FRDM-K28F board support -->
    <bundle Cbundle="FRDM-K28F" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP FRDM-K28F board support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="MK28F15 CMSIS">
      <description>LED driver for NXP FRDM-K28F board</description>
        <files>
          <file category="source" name="Boards/NXP/FRDM-K28F/Common/LED_FRDM-K28F.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="MK28F15 CMSIS">
      <description>Button driver for NXP FRDM-K28F board</description>
        <files>
          <file category="source" name="Boards/NXP/FRDM-K28F/Common/Buttons_FRDM-K28F.c"/>
        </files>
      </component>
    </bundle>

  </components>

