ghsecuritylab/stm32_linux/Projects/udemy/Packages/.cache/Keil.Kinetis_K20_DFP.1.5.1.pdsc
  <boards>
    <board name="TWR-K24F120M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>The TWR-K24F120M is a development tool for the 120 MHz K20 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="NXP:11" Dname="MK24FN256xxx12"/>
      <compatibleDevice  deviceIndex="0" Dvendor="NXP:11" Dfamily="K20 Series"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Batt"      n="1"              name="Battery holder for 20mm lithium battery (e.g. 2032, 2025)"/>
      <feature type="USB"       n="1"              name="USB Micro-AB Connector"/>
      <feature type="ConnOther" n="1"              name="Touch Tower Plug-in Socket"/>
      <feature type="ConnOther" n="1"              name="General purpose Tower Plug-in (TWRPI) socket"/>
      <feature type="ConnOther" n="2"              name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I2C, Flexbus, etc."/>
      <feature type="Poti"      n="1"/>
      <feature type="Button"    n="3"/>
      <feature type="Accelerometer" n="1"          name="Three axis accelerometer (MMA8451Q)"/>
      <feature type="LED"       n="4"              name="Four user-controlled status LEDs"/>
      <feature type="TowerFF"   n="1"/>
    </board>

    <board name="TWR-K20D50M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>The TWR-K20D50M is a development tool for the 50 MHz K20 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="NXP:11" Dname="MK20DX128xxx5"/>
      <compatibleDevice  deviceIndex="0" Dvendor="NXP:11" Dfamily="K20 Series"/>
    </board>

    <board name="TWR-K20D72M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>The TWR-K20D72M is a development tool for the 72 MHz K20 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="NXP:11" Dname="MK20DX256xxx7"/>
      <compatibleDevice  deviceIndex="0" Dvendor="NXP:11" Dfamily="K20 Series"/>
    </board>

    <board name="TWR-K22F120M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>The TWR-K22F120M is a development tool for the 120 MHz K20 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="NXP:11" Dname="MK22FN512xxx12"/>
      <compatibleDevice  deviceIndex="0" Dvendor="NXP:11" Dfamily="K20 Series"/>
    </board>

    <board name="FRDM-K20D50M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>The FRDM-K20D50M is a development tool for the 50 MHz K20 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="NXP:11" Dname="MK20DX128xxx5"/>
      <compatibleDevice  deviceIndex="0" Dvendor="NXP:11" Dfamily="K20 Series"/>
    </board>

    <board name="FRDM-K28F" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>The FRDM-K28F is a development tool for the 150 MHz K28 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="NXP:11" Dname="MK28FN2M0xxx15"/>
      <compatibleDevice  deviceIndex="0" Dvendor="NXP:11" Dfamily="K20 Series"/>
    </board>
  </boards>

  <examples>
    <!-- TWR-K20D50M Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-K20D50M/Blinky">
      <description>Blinky example</description>
      <board name="TWR-K20D50M" vendor="NXP" Dvendor="NXP:11" Dname="MK20DX128xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-K20D50M/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K20D50M" vendor="NXP" Dvendor="NXP:11" Dname="MK20DX128xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- FRDM-K20D50M Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/FRDM-K20D50M/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-K20D50M" vendor="NXP" Dvendor="NXP:11" Dname="MK20DX128xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-K20D72M Development Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-K20D72M/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K20D72M" vendor="NXP" Dvendor="NXP:11" Dname="MK20DX256xxx7"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-K22F120M Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-K22F120M/Blinky">
      <description>Blinky example</description>
      <board name="TWR-K22F120M" vendor="NXP" Dvendor="NXP:11" Dname="MK22FN512xxx12"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-K22F120M/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K22F120M" vendor="NXP" Dvendor="NXP:11" Dname="MK22FN512xxx12"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-K24F120M Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-K24F120M/Blinky">
      <description>Blinky example</description>
      <board name="TWR-K24F120M" vendor="NXP" Dvendor="NXP:11" Dname="MK24FN256xxx12"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-K24F120M/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K24F120M" vendor="NXP" Dvendor="NXP:11" Dname="MK24FN256xxx12"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- FRDM-K28F Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/FRDM-K28F/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-K28F" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
